Revit 2027 API
PrintManager.ViewSheetSetting Property
 The ViewSheetSetting which manages the view/sheet set information of current document, and you can change the default view/sheet set for current project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ViewSheetSetting ViewSheetSetting { get; }
Public ReadOnly Property ViewSheetSetting As ViewSheetSetting
	Get
public:
property ViewSheetSetting^ ViewSheetSetting {
	ViewSheetSetting^ get ();
}
member ViewSheetSetting : ViewSheetSetting with get
Property Value
ViewSheetSetting
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when the print range is not selected views/sheets.
See Also
Reference
PrintManager Class
Autodesk.Revit.DB Namespace